# Clear Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerTable..::..Clear Method
ExportLayerTable Class See Also
---
Removes all contents stored in the table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void Clear()
```

Visual Basic
---
```text
Public Sub Clear
```

Visual C++
---
```text
public:
void Clear()
```

# See Also
ExportLayerTable Class
Autodesk.Revit.DB Namespace